###############################################################################
# Created by write_sdc
# Sat Jun  8 07:58:45 2024
###############################################################################
current_design CNN_Accelerator_Top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_clock_latency -source -min 4.6500 [get_clocks {clk}]
set_clock_latency -source -max 5.5700 [get_clocks {clk}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -add_delay [get_ports {reset}]
set_input_delay 4.1300 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {serial_line_data[0]}]
set_input_delay 4.1300 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {serial_line_data[0]}]
set_input_delay 4.1300 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {serial_line_data[1]}]
set_input_delay 4.1300 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {serial_line_data[1]}]
set_input_delay 4.1300 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {serial_line_data[2]}]
set_input_delay 4.1300 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {serial_line_data[2]}]
set_input_delay 4.1300 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {serial_line_data[3]}]
set_input_delay 4.1300 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {serial_line_data[3]}]
set_input_delay 4.1300 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {serial_line_data[4]}]
set_input_delay 4.1300 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {serial_line_data[4]}]
set_input_delay 4.1300 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {serial_line_data[5]}]
set_input_delay 4.1300 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {serial_line_data[5]}]
set_input_delay 4.1300 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {serial_line_data[6]}]
set_input_delay 4.1300 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {serial_line_data[6]}]
set_input_delay 4.1300 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {serial_line_data[7]}]
set_input_delay 4.1300 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {serial_line_data[7]}]
set_input_delay 3.1700 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {serial_line_valid}]
set_input_delay 3.1700 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {serial_line_valid}]
set_input_delay 0.3000 -clock [get_clocks {clk}] -rise -min -add_delay [get_ports {serial_weight_data[0]}]
set_input_delay 0.3000 -clock [get_clocks {clk}] -fall -min -add_delay [get_ports {serial_weight_data[0]}]
set_input_delay 0.3000 -clock [get_clocks {clk}] -rise -min -add_delay [get_ports {serial_weight_data[1]}]
set_input_delay 0.3000 -clock [get_clocks {clk}] -fall -min -add_delay [get_ports {serial_weight_data[1]}]
set_input_delay 0.3000 -clock [get_clocks {clk}] -rise -min -add_delay [get_ports {serial_weight_data[2]}]
set_input_delay 0.3000 -clock [get_clocks {clk}] -fall -min -add_delay [get_ports {serial_weight_data[2]}]
set_input_delay 0.3000 -clock [get_clocks {clk}] -rise -min -add_delay [get_ports {serial_weight_data[3]}]
set_input_delay 0.3000 -clock [get_clocks {clk}] -fall -min -add_delay [get_ports {serial_weight_data[3]}]
set_input_delay 0.3000 -clock [get_clocks {clk}] -rise -min -add_delay [get_ports {serial_weight_data[4]}]
set_input_delay 0.3000 -clock [get_clocks {clk}] -fall -min -add_delay [get_ports {serial_weight_data[4]}]
set_input_delay 0.3000 -clock [get_clocks {clk}] -rise -min -add_delay [get_ports {serial_weight_data[5]}]
set_input_delay 0.3000 -clock [get_clocks {clk}] -fall -min -add_delay [get_ports {serial_weight_data[5]}]
set_input_delay 0.3000 -clock [get_clocks {clk}] -rise -min -add_delay [get_ports {serial_weight_data[6]}]
set_input_delay 0.3000 -clock [get_clocks {clk}] -fall -min -add_delay [get_ports {serial_weight_data[6]}]
set_input_delay 0.3000 -clock [get_clocks {clk}] -rise -min -add_delay [get_ports {serial_weight_data[7]}]
set_input_delay 0.3000 -clock [get_clocks {clk}] -fall -min -add_delay [get_ports {serial_weight_data[7]}]
set_input_delay 3.7400 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {serial_weight_valid}]
set_input_delay 3.7400 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {serial_weight_valid}]
set_input_delay 4.1300 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {start}]
set_input_delay 4.1300 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {start}]
set_output_delay 0.7000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {done}]
set_output_delay 0.7000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {done}]
set_output_delay 0.7000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {serial_result[0]}]
set_output_delay 0.7000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {serial_result[0]}]
set_output_delay 0.7000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {serial_result[1]}]
set_output_delay 0.7000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {serial_result[1]}]
set_output_delay 0.7000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {serial_result[2]}]
set_output_delay 0.7000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {serial_result[2]}]
set_output_delay 0.7000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {serial_result[3]}]
set_output_delay 0.7000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {serial_result[3]}]
set_output_delay 0.7000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {serial_result[4]}]
set_output_delay 0.7000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {serial_result[4]}]
set_output_delay 0.7000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {serial_result[5]}]
set_output_delay 0.7000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {serial_result[5]}]
set_output_delay 0.7000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {serial_result[6]}]
set_output_delay 0.7000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {serial_result[6]}]
set_output_delay 0.7000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {serial_result[7]}]
set_output_delay 0.7000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {serial_result[7]}]
set_output_delay 0.7000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {serial_result_valid}]
set_output_delay 0.7000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {serial_result_valid}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.4000 [get_ports {done}]
set_load -pin_load 0.4000 [get_ports {serial_result_valid}]
set_load -pin_load 0.4000 [get_ports {serial_result[7]}]
set_load -pin_load 0.4000 [get_ports {serial_result[6]}]
set_load -pin_load 0.4000 [get_ports {serial_result[5]}]
set_load -pin_load 0.4000 [get_ports {serial_result[4]}]
set_load -pin_load 0.4000 [get_ports {serial_result[3]}]
set_load -pin_load 0.4000 [get_ports {serial_result[2]}]
set_load -pin_load 0.4000 [get_ports {serial_result[1]}]
set_load -pin_load 0.4000 [get_ports {serial_result[0]}]
set_input_transition 0.6100 [get_ports {clk}]
set_input_transition -rise -max 0.1700 [get_ports {serial_line_valid}]
set_input_transition -fall -max 0.1700 [get_ports {serial_line_valid}]
set_input_transition -rise -max 0.1800 [get_ports {serial_weight_valid}]
set_input_transition -fall -max 0.1800 [get_ports {serial_weight_valid}]
set_input_transition -rise -max 0.8400 [get_ports {start}]
set_input_transition -fall -max 0.8400 [get_ports {start}]
set_input_transition -rise -max 0.9200 [get_ports {serial_line_data[7]}]
set_input_transition -fall -max 0.9200 [get_ports {serial_line_data[7]}]
set_input_transition -rise -max 0.9200 [get_ports {serial_line_data[6]}]
set_input_transition -fall -max 0.9200 [get_ports {serial_line_data[6]}]
set_input_transition -rise -max 0.9200 [get_ports {serial_line_data[5]}]
set_input_transition -fall -max 0.9200 [get_ports {serial_line_data[5]}]
set_input_transition -rise -max 0.9200 [get_ports {serial_line_data[4]}]
set_input_transition -fall -max 0.9200 [get_ports {serial_line_data[4]}]
set_input_transition -rise -max 0.9200 [get_ports {serial_line_data[3]}]
set_input_transition -fall -max 0.9200 [get_ports {serial_line_data[3]}]
set_input_transition -rise -max 0.9200 [get_ports {serial_line_data[2]}]
set_input_transition -fall -max 0.9200 [get_ports {serial_line_data[2]}]
set_input_transition -rise -max 0.9200 [get_ports {serial_line_data[1]}]
set_input_transition -fall -max 0.9200 [get_ports {serial_line_data[1]}]
set_input_transition -rise -max 0.9200 [get_ports {serial_line_data[0]}]
set_input_transition -fall -max 0.9200 [get_ports {serial_line_data[0]}]
set_input_transition -rise -max 0.9700 [get_ports {serial_weight_data[7]}]
set_input_transition -fall -max 0.9700 [get_ports {serial_weight_data[7]}]
set_input_transition -rise -max 0.9700 [get_ports {serial_weight_data[6]}]
set_input_transition -fall -max 0.9700 [get_ports {serial_weight_data[6]}]
set_input_transition -rise -max 0.9700 [get_ports {serial_weight_data[5]}]
set_input_transition -fall -max 0.9700 [get_ports {serial_weight_data[5]}]
set_input_transition -rise -max 0.9700 [get_ports {serial_weight_data[4]}]
set_input_transition -fall -max 0.9700 [get_ports {serial_weight_data[4]}]
set_input_transition -rise -max 0.9700 [get_ports {serial_weight_data[3]}]
set_input_transition -fall -max 0.9700 [get_ports {serial_weight_data[3]}]
set_input_transition -rise -max 0.9700 [get_ports {serial_weight_data[2]}]
set_input_transition -fall -max 0.9700 [get_ports {serial_weight_data[2]}]
set_input_transition -rise -max 0.9700 [get_ports {serial_weight_data[1]}]
set_input_transition -fall -max 0.9700 [get_ports {serial_weight_data[1]}]
set_input_transition -rise -max 0.9700 [get_ports {serial_weight_data[0]}]
set_input_transition -fall -max 0.9700 [get_ports {serial_weight_data[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.0000 [current_design]
set_max_fanout 16.0000 [current_design]
